readme.md

# Table of Contents

1.  [Topics (tbc)](#org650bd72)
    1.  [Discourse referents and dynamic notions of content](#orgc882b24)
    2.  [Integrating dynamic and compositional semantics](#orgf729b43)
    3.  [Predictive dynamics](#org3e88494)
    4.  [Plurality and maximality](#org0886e4e)
    5.  [Dynamic inquisitive semantics](#org0c3ebe1)
    6.  [Dynamic semantics and the grammar](#org94c60b9)
2.  [References](#orgf059688)



<a id="org650bd72"></a>

# Topics (tbc)

Last updated: "<span class="timestamp-wrapper"><span class="timestamp">[2022-01-08 Sat 16:50]</span></span>"


<a id="orgc882b24"></a>

## Discourse referents and dynamic notions of content

-   (<a href="#citeproc_bib_item_10">Heim 1982</a>)
-   (<a href="#citeproc_bib_item_9">Groenendijk and Stokhof 1991</a>)
-   (<a href="#citeproc_bib_item_4">Chierchia 1995</a>)


<a id="orgf729b43"></a>

## Integrating dynamic and compositional semantics

-   (<a href="#citeproc_bib_item_8">Groenendijk and Stokhof 1990</a>)
-   (<a href="#citeproc_bib_item_12">Muskens 1996</a>)
-   (<a href="#citeproc_bib_item_3">Charlow 2014</a>)


<a id="org3e88494"></a>

## Predictive dynamics

-   (<a href="#citeproc_bib_item_16">Schlenker 2010</a>)
-   (<a href="#citeproc_bib_item_15">Schlenker 2009</a>)
-   (<a href="#citeproc_bib_item_14">Schlenker 2008</a>)


<a id="org0886e4e"></a>

## Plurality and maximality

-   (<a href="#citeproc_bib_item_1">van den Berg 1996</a>)
-   (<a href="#citeproc_bib_item_2">Brasoveanu 2007</a>)
-   (<a href="#citeproc_bib_item_11">Keshet 2018</a>)


<a id="org0c3ebe1"></a>

## Dynamic inquisitive semantics

-   (<a href="#citeproc_bib_item_7">Dotlačil and Roelofsen 2019</a>)
-   (<a href="#citeproc_bib_item_6">Dotlacil and Roelofsen 2021</a>)


<a id="org94c60b9"></a>

## Dynamic semantics and the grammar

-   (<a href="#citeproc_bib_item_5">Chierchia 2020</a>)
-   (<a href="#citeproc_bib_item_13">Schlenker 2005</a>)


<a id="orgf059688"></a>

# References

<style>.csl-entry{text-indent: -1.5em; margin-left: 1.5em;}</style><div class="csl-bib-body">
  <div class="csl-entry"><a id="citeproc_bib_item_1"></a>Berg, M. H. van den. 1996. “Some Aspects of the Internal Structure of Discourse. The Dynamics of Nominal Anaphora.” <a href="https://dare.uva.nl/search?arno.record.id=7073">https://dare.uva.nl/search?arno.record.id=7073</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_2"></a>Brasoveanu, Adrian. 2007. “Structured Nominal and Modal Reference.” PhD thesis, Rutgers University - Graduate School - New Brunswick.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_3"></a>Charlow, Simon. 2014. “On the Semantics of Exceptional Scope.” PhD thesis, New Brunswick: Rutgers University.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_4"></a>Chierchia, Gennaro. 1995. <i>Dynamics of Meaning - Anaphora, Presupposition, and the Theory of Grammar</i>. Chicago: University of Chicago Press.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_5"></a>———. 2020. “Origins of Weak Crossover - When Dynamic Semantics Meets Event Semantics.” <i>Natural Language Semantics</i>, no. 28: 23–76.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_6"></a>Dotlacil, Jakub, and Floris Roelofsen. 2021. “A Dynamic Semantics of Single-Wh and Multiple-Wh Questions.” <i>Semantics and Linguistic Theory</i> 30 (0, 0): 376–95. <a href="https://doi.org/10.3765/salt.v30i0.4839">https://doi.org/10.3765/salt.v30i0.4839</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_7"></a>Dotlačil, Jakub, and Floris Roelofsen. 2019. “Dynamic Inquisitive Semantics: Anaphora and Questions.” <i>Proceedings of Sinn Und Bedeutung</i>, July, 365–82 Pages. <a href="https://doi.org/10.18148/SUB/2019.V23I1.538">https://doi.org/10.18148/SUB/2019.V23I1.538</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_8"></a>Groenendijk, Jeroen, and Martin Stokhof. 1990. “Dynamic Montague Grammar.” Report. <a href="https://eprints.illc.uva.nl/id/eprint/1148/">https://eprints.illc.uva.nl/id/eprint/1148/</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_9"></a>———. 1991. “Dynamic Predicate Logic.” <i>Linguistics and Philosophy</i> 14 (1): 39–100. <a href="https://www.jstor.org/stable/25001418">https://www.jstor.org/stable/25001418</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_10"></a>Heim, Irene. 1982. “The Semantics of Definite and Indefinite Noun Phrases.” PhD thesis, University of Massachusetts - Amherst.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_11"></a>Keshet, Ezra. 2018. “Dynamic Update Anaphora Logic - A Simple Analysis of Complex Anaphora.” <i>Journal of Semantics</i> 35 (2): 263–303. <a href="https://doi.org/10.1093/jos/ffx020">https://doi.org/10.1093/jos/ffx020</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_12"></a>Muskens, Reinhard. 1996. “Combining Montague Semantics and Discourse Representation.” <i>Linguistics and Philosophy</i> 19 (2): 143–86. <a href="https://doi.org/10.1007/BF00635836">https://doi.org/10.1007/BF00635836</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_13"></a>Schlenker, Philippe. 2005. “Non-Redundancy: Towards a Semantic Reinterpretation of Binding Theory.” <i>Natural Language Semantics</i> 13 (1): 1–92. <a href="https://doi.org/10.1007/s11050-004-2440-1">https://doi.org/10.1007/s11050-004-2440-1</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_14"></a>———. 2008. “Be Articulate: A Pragmatic Theory of Presupposition Projection.” <i>Theoretical Linguistics</i> 34 (3). <a href="https://doi.org/10.1515/THLI.2008.013">https://doi.org/10.1515/THLI.2008.013</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_15"></a>———. 2009. “Local Contexts.” <i>Semantics and Pragmatics</i> 2 (July). <a href="https://doi.org/10.3765/sp.2.3">https://doi.org/10.3765/sp.2.3</a>.</div>
  <div class="csl-entry"><a id="citeproc_bib_item_16"></a>———. 2010. “Local Contexts and Local Meanings.” <i>Philosophical Studies: An International Journal for Philosophy in the Analytic Tradition</i> 151 (1): 115–42. <a href="https://doi.org/10.2307/40856594">https://doi.org/10.2307/40856594</a>.</div>
</div>

